БИТУправление_медицинским_центром_демо/src/InformationRegisters/НастройкиМедицинскогоУчета/НастройкиМедицинскогоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиМедицинскогоУчета</name>
  <resources>
    <name>ИспользоватьЛабораторныеИсследования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуетсяРасширеннаяВнутренняяЛаборатория</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуетсяИнтеграцияСВнешнимиЛабораториями</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЛабораторияПоПостоплатеПрименяется</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Helix_ИспользуетсяИнтеграцияСHelix</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПакетСоставныхФразРеакцииНаАллергены</name>
    <type>
      <types>CatalogRef.ПакетыСоставныхФраз</types>
    </type>
  </resources>
  <resources>
    <name>ОтправлятьРезультатыВнешнихЛабораторийПоЭлектроннойПочте</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтправлятьПриемыВАрхивеСПаролем</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭлектроннаяПочтаДляРассылки</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </resources>
  <resources>
    <name>Invitro_ИспользуетсяИнтеграцияСInvitro</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Использоватьwkhtmltopdf</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Адресwkhtmltopdf</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УпрощеннаяЛабораторияИспользуется</name>
    <comment>Допускается упрощенное указание забора без лаборатории и с кодом пробы</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьЕГИСЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СитиЛаб_ИспользуетсяИнтеграцияССитиЛаб</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КДЛ_ИспользуетсяИнтеграцияСКДЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РабочийРежимОбменаСФСС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПутьККонвертеруPDFAGhostScript</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>АдресФедеральногоСервисаГИП</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>АдресФедеральногоСервисаРЭМД</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СертификатФССТестовый</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>СертификатФССРабочий</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Гемотест_ИспользуетсяИнтеграцияСГемотест</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтключитьКонтрольСертификатовФСС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьЛистыНетрудоспособности</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПостоплатаПоПриемамИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьЭлектронныеПодписиЭМК</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтладочныйРежимРаботыЕГИСЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ХранитьФайлыЭМДВоВнешнемАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПутьКАрхивуЭМД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПутьКАрхивуИзображений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/НастройкиМедицинскогоУчета/Forms/НастройкаИсточниковПостоплаты/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Настройка элементов формы
	
	// Приемы
	ПостоплатаПоПриемамИспользуется = УправлениеНастройкамиПереопределяемый.ПолучитьПараметрУчета("ПостоплатаПоПриемамИспользуется") = Истина;
	
	// Лаборатории
	Если Метаданные.Подсистемы.Найти("ЛабораторныеИсследования") <> Неопределено Тогда
		ЛабораторияИспользуется = УправлениеНастройкамиПереопределяемый.ПолучитьПараметрУчета("ИспользоватьЛабораторныеИсследования") = Истина;
		ЛабораторияПоПостоплатеПрименяется = ЛабораторияИспользуется И УправлениеНастройкамиПереопределяемый.ПолучитьПараметрУчета("ЛабораторияПоПостоплатеПрименяется") = Истина;
		
		Элементы.ЛабораторияПоПостоплатеПрименяется.Доступность = ЛабораторияИспользуется;
	Иначе
		Элементы.ЛабораторияПоПостоплатеПрименяется.Видимость = Ложь;
	КонецЕсли;
	
	// Вакцинации
	Если Метаданные.НайтиПоПолномуИмени("Подсистемы.Медицина.Подсистемы.Вакцинации") <> Неопределено Тогда
		ИспользоватьВакцинации = УправлениеНастройкамиПереопределяемый.ПолучитьПараметрУчета("ИспользоватьВакцинации") = Истина;
	Иначе
		Элементы.ИспользоватьВакцинации.Видимость = Ложь;
	КонецЕсли;
	
	Если  Не Элементы.ЛабораторияПоПостоплатеПрименяется.Видимость
		И Не Элементы.ИспользоватьВакцинации.Видимость
	Тогда
		Элементы.ПостоплатаПоПриемамИспользуется.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	УправлениеНастройкамиПереопределяемый.УстановитьПараметрУчета("ПостоплатаПоПриемамИспользуется", ПостоплатаПоПриемамИспользуется);
	Если Элементы.ЛабораторияПоПостоплатеПрименяется.Видимость Тогда
		УправлениеНастройкамиПереопределяемый.УстановитьПараметрУчета("ЛабораторияПоПостоплатеПрименяется", ЛабораторияПоПостоплатеПрименяется);
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
